# CantMakeFillets Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..CantMakeFillets Property
BuiltInFailures..::..RebarFailures Class See Also
---
The bar cannot be bent in that shape. Check the bending diameter and the bar type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantMakeFillets { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantMakeFillets As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantMakeFillets {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace